In [2]:
import pandas as pd
mydataSet = {
    "Name": ["john", "den", "lily", "code", "react", "angular", "Django" ],
    "science":[10,12,21,23,12,45,42],
    "math":   [11,21,11,34,32,50,43]
}

dataSet= pd.DataFrame(mydataSet)

In [3]:
dataSet

      Name  science  math
0     john       10    11
1      den       12    21
2     lily       21    11
3     code       23    34
4    react       12    32
5  angular       45    50
6   Django       42    43

In [4]:
df = dataSet

In [5]:
df.max()

Name       react
science       45
math          50
dtype: object

In [6]:
# use aggregate
df.aggregate(['max', 'min'])

       Name  science  math
max   react       45    50
min  Django       10    11

In [7]:
df.aggregate(["min", "max", "count", "var", "std"])

/tmp/ipykernel_8020/1744666162.py:1: FutureWarning: ['Name'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.aggregate(["min", "max", "count", "var", "std"])

         Name     science        math
min    Django   10.000000   11.000000
max     react   45.000000   50.000000
count       7    7.000000    7.000000
var       NaN  209.619048  230.476190
std       NaN   14.478227   15.181442

In [12]:
df[["math", "science"]].aggregate(["min","max", "sum"])

     math  science
min    11       10
max    50       45
sum   202      165